In [1]:
# Busca todo actor llamado 'Scarlett'

In [2]:
import pandas as pd

In [3]:
actors = pd.read_csv('./data/actor.csv')

Index(['actor_id', 'first_name', 'last_name', 'last_update'], dtype='object')

In [5]:
actors[actors['first_name']=='scarlett']

Empty DataFrame
Columns: [actor_id, first_name, last_name, last_update]
Index: []

In [6]:
# Cuántos apellidos únicos hay entre actores y cuantas veces se repite cada uno de ellos?
actors['last_name'].value_counts()

KILMER     5
TEMPLE     4
NOLTE      4
GUINESS    3
ALLEN      3
          ..
JOLIE      1
DAMON      1
CRUZ       1
SINATRA    1
WALKEN     1
Name: last_name, Length: 121, dtype: int64

In [3]:
# Puedes rentar "Academy Dinosaur" de la tienda 1?

In [7]:
film = pd.read_csv('./data/film.csv')
inventory = pd.read_csv('./data/inventory.csv')
store = pd.read_csv('./data/store.csv')

In [8]:
combined_df = pd.merge(film, inventory, on='film_id')

In [13]:
combined_df[(combined_df['title'] == 'ACADEMY DINOSAUR') & (combined_df['store_id'] == 1)]

,film_id,title,description,release_year,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update_x,inventory_id,store_id,last_update_y
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,NaN,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes",2006-02-15 05:03:42,1,1,2006-02-15 05:09:17
1,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,NaN,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes",2006-02-15 05:03:42,2,1,2006-02-15 05:09:17
2,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,NaN,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes",2006-02-15 05:03:42,3,1,2006-02-15 05:09:17
3,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,NaN,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes",2006-02-15 05:03:42,4,1,2006-02-15 05:09:17

In [15]:
# En qué tiendas está disponible Agent Truman?
combined_df[(combined_df['title'] == 'AGENT TRUMAN')]['store_id'].unique()

array([1, 2])

In [16]:
# Crea un DataFrame basado en rentals pero que incluya la información del cliente que lo rentó
rentals = pd.read_csv('./data/rental.csv')
customer = pd.read_csv('./data/customer.csv')

In [18]:
pd.merge(rentals, customer, on='customer_id')

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update_x,store_id,first_name,last_name,email,address_id,active,create_date,last_update_y
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53,1,CHARLOTTE,HUNTER,CHARLOTTE.HUNTER@sakilacustomer.org,134,1,2006-02-14 22:04:36,2006-02-15 04:57:20
1,746,2005-05-29 09:25:10,4272,130,2005-06-02 04:20:10,2,2006-02-15 21:30:53,1,CHARLOTTE,HUNTER,CHARLOTTE.HUNTER@sakilacustomer.org,134,1,2006-02-14 22:04:36,2006-02-15 04:57:20
2,1630,2005-06-16 07:55:01,2413,130,2005-06-19 06:38:01,1,2006-02-15 21:30:53,1,CHARLOTTE,HUNTER,CHARLOTTE.HUNTER@sakilacustomer.org,134,1,2006-02-14 22:04:36,2006-02-15 04:57:20
3,1864,2005-06-17 01:39:47,1815,130,2005-06-24 19:39:47,2,2006-02-15 21:30:53,1,CHARLOTTE,HUNTER,CHARLOTTE.HUNTER@sakilacustomer.org,134,1,2006-02-14 22:04:36,2006-02-15 04:57:20
4,2163,2005-06-17 23:46:16,2600,130,2005-06-22 22:48:16,2,2006-02-15 21:30:53,1,CHARLOTTE,HUNTER,CHARLOTTE.HUNTER@sakilacustomer.org,134,1,2006-02-14 22:04:36,2006-02-15 04:57:20
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
16039,12099,2005-08-17 22:38:54,1743,195,2005-08-18 21:29:54,2,2006-02-15 21:30:53,1,VANESSA,SIMS,VANESSA.SIMS@sakilacustomer.org,199,1,2006-02-14 22:04:36,2006-02-15 04:57:20
16040,12941,2005-08-19 05:39:26,2951,195,2005-08-22 09:50:26,2,2006-02-15 21:30:53,1,VANESSA,SIMS,VANESSA.SIMS@sakilacustomer.org,199,1,2006-02-14 22:04:36,2006-02-15 04:57:20
16041,13741,2005-08-20 10:48:47,3887,195,2005-08-21 11:19:47,1,2006-02-15 21:30:53,1,VANESSA,SIMS,VANESSA.SIMS@sakilacustomer.org,199,1,2006-02-14 22:04:36,2006-02-15 04:57:20
16042,14751,2005-08-21 23:11:23,1156,195,2005-08-30 20:01:23,2,2006-02-15 21:30:53,1,VANESSA,SIMS,VANESSA.SIMS@sakilacustomer.org,199,1,2006-02-14 22:04:36,2006-02-15 04:57:20
16043,16040,2005-08-23 22:19:33,3524,195,2005-09-02 02:19:33,2,2006-02-15 21:30:53,1,VANESSA,SIMS,VANESSA.SIMS@sakilacustomer.org,199,1,2006-02-14 22:04:36,2006-02-15 04:57:20